Synwit-Co-Ltd/SWM160/SWM160_Lib/SWM160_StdPeriph_Driver/CSL/SWM160_StdPeriph_Driver/SWM160_timr.c
	case ((uint32_t)TIMR3):
		TIMRG->IM3 &= ~(1 << TIMRG_IM_IF_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_INTDis()
* 功能说明:	禁能中断
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_INTDis(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->IM0 |= (1 << TIMRG_IM_IF_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->IM1 |= (1 << TIMRG_IM_IF_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->IM2 |= (1 << TIMRG_IM_IF_Pos);
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->IM3 |= (1 << TIMRG_IM_IF_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	TIMR_INTClr()
* 功能说明:	清除中断标志
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_INTClr(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->IF0 = (0x01 << TIMRG_IF_IF_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->IF1 = (0x01 << TIMRG_IF_IF_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->IF2 = (0x01 << TIMRG_IF_IF_Pos);
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->IF3 = (0x01 << TIMRG_IF_IF_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_INTStat()
* 功能说明:	获取中断状态
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: uint32_t 				0 TIMRx未产生中断    1 TIMRx产生了中断
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_INTStat(TIMR_TypeDef * TIMRx)
{
	uint32_t stat = 0;
	
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		stat = ((TIMRG->IF0 >> TIMRG_IF_IF_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR1):
		stat = ((TIMRG->IF1 >> TIMRG_IF_IF_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR2):
		stat = ((TIMRG->IF2 >> TIMRG_IF_IF_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR3):
		stat = ((TIMRG->IF3 >> TIMRG_IF_IF_Pos) & 1);
		break;
	}
	
	return stat;
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_OC_Init()
* 功能说明:	输出比较功能初始化
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
*			uint16_t match			当计数器的值递减到match时引脚输出电平翻转
*			uint32_t match_int_en	当计数器的值递减到match时是否产生中断
*			uint32_t init_lvl		初始输出电平
* 输    出: 无
* 注意事项: 使用Output Compare功能时TIMRx只有16位
******************************************************************************************************************************************/
void TIMR_OC_Init(TIMR_TypeDef * TIMRx, uint16_t match, uint32_t match_int_en, uint32_t init_lvl)
{
	TIMRx->CTRL &= ~(TIMR_CTRL_OC_MODE_Msk | TIMR_CTRL_OC_INILVL_Msk);
	TIMRx->CTRL |= (0 << TIMR_CTRL_OC_MODE_Pos) |
				   (init_lvl << TIMR_CTRL_OC_INILVL_Pos);
	
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->OCEN |= (1 << TIMRG_OCEN_TIMR0_Pos);
		TIMRG->OCMSK &= ~(1 << TIMRG_OCMSK_TIMR0_Pos);
		TIMRG->OCMAT0 = ((TIMR0->LDVAL) << 16) | match;
		TIMR_OC_INTClr(TIMR0);
		TIMRG->IE0 |= (1 << TIMRG_IE_OCMAT1_Pos);
		if(match_int_en) TIMRG->IM0 &= ~(1 << TIMRG_IM_OCMAT1_Pos);
		else			 TIMRG->IM0 |=  (1 << TIMRG_IM_OCMAT1_Pos);
		if(match_int_en | ((TIMRG->IM0 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR0_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR0_IRQn);
		}
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->OCEN |= (1 << TIMRG_OCEN_TIMR1_Pos);
		TIMRG->OCMSK &= ~(1 << TIMRG_OCMSK_TIMR1_Pos);
		TIMRG->OCMAT1 =  ((TIMR1->LDVAL) << 16) | match;
		TIMR_OC_INTClr(TIMR1);
		TIMRG->IE1 |= (1 << TIMRG_IE_OCMAT1_Pos);
		if(match_int_en) TIMRG->IM1 &= ~(1 << TIMRG_IM_OCMAT1_Pos);
		else			 TIMRG->IM1 |=  (1 << TIMRG_IM_OCMAT1_Pos);
		if(match_int_en | ((TIMRG->IM1 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR1_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR1_IRQn);
		}
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->OCEN |= (1 << TIMRG_OCEN_TIMR2_Pos);
		TIMRG->OCMSK &= ~(1 << TIMRG_OCMSK_TIMR2_Pos);
		TIMRG->OCMAT2 =  ((TIMR2->LDVAL) << 16) | match;
		TIMR_OC_INTClr(TIMR2);
		TIMRG->IE2 |= (1 << TIMRG_IE_OCMAT1_Pos);
		if(match_int_en) TIMRG->IM2 &= ~(1 << TIMRG_IM_OCMAT1_Pos);
		else			 TIMRG->IM2 |=  (1 << TIMRG_IM_OCMAT1_Pos);
		if(match_int_en | ((TIMRG->IM2 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR2_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR2_IRQn);
		}
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->OCEN |= (1 << TIMRG_OCEN_TIMR3_Pos);
		TIMRG->OCMSK &= ~(1 << TIMRG_OCMSK_TIMR3_Pos);
		TIMRG->OCMAT3 =  ((TIMR3->LDVAL) << 16) | match;
		TIMR_OC_INTClr(TIMR3);
		TIMRG->IE3 |= (1 << TIMRG_IE_OCMAT1_Pos);
		if(match_int_en) TIMRG->IM3 &= ~(1 << TIMRG_IM_OCMAT1_Pos);
		else			 TIMRG->IM3 |=  (1 << TIMRG_IM_OCMAT1_Pos);
		if(match_int_en | ((TIMRG->IM3 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR3_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR3_IRQn);
		}
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	TIMR_OC_OutputEn()
* 功能说明:	使能输出比较功能的波形输出
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_OutputEn(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->OCMSK &= ~(1 << TIMRG_OCMSK_TIMR0_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->OCMSK &= ~(1 << TIMRG_OCMSK_TIMR1_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->OCMSK &= ~(1 << TIMRG_OCMSK_TIMR2_Pos);
		break;
	
