Synwit-Co-Ltd/SWM160/SWM160_Lib/SWM160_StdPeriph_Driver/CSL/SWM160_StdPeriph_Driver/SWM160_timr.c
	case ((uint32_t)TIMR3):
		stat = ((TIMRG->IF3 >> TIMRG_IF_OCMAT1_Pos) & 1);
		break;
	}
	
	return stat;
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_IC_Init()
* 功能说明:	输入捕获功能初始化
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
*			uint32_t start_lvl		0 起始测量低电平长度    1 起始测量高电平长度
*			uint32_t captureH_int_en	测量高电平长度完成中断使能
*			uint32_t captureL_int_en	测量低电平长度完成中断使能
*			uint32_t captureOV_int_en	测量高/低电平长度溢出中断使能
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_Init(TIMR_TypeDef * TIMRx, uint32_t start_lvl, uint32_t captureH_int_en, uint32_t captureL_int_en, uint32_t captureOV_int_en)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->ICCR &= ~(TIMRG_ICCR_EN0_Msk | TIMRG_ICCR_POL0_Msk);
		TIMRG->ICCR |= (1 << TIMRG_ICCR_EN0_Pos) |
					   (start_lvl << TIMRG_ICCR_POL0_Pos);
		TIMRG->IE0 |= (1 << TIMRG_IE_ICH_Pos) |
					  (1 << TIMRG_IE_ICL_Pos) |
					  (1 << TIMRG_IE_ICOV_Pos);
		TIMR_IC_CaptureH_INTClr(TIMR0);
		if(captureH_int_en)  TIMRG->IM0 &= ~(1 << TIMRG_IM_ICH_Pos);
		else                 TIMRG->IM0 |=  (1 << TIMRG_IM_ICH_Pos);
		TIMR_IC_CaptureL_INTClr(TIMR0);
		if(captureL_int_en)  TIMRG->IM0 &= ~(1 << TIMRG_IM_ICL_Pos);
		else                 TIMRG->IM0 |=  (1 << TIMRG_IM_ICL_Pos);
		TIMR_IC_CaptureOV_INTClr(TIMR0);
		if(captureOV_int_en) TIMRG->IM0 &= ~(1 << TIMRG_IM_ICOV_Pos);
		else                 TIMRG->IM0 |=  (1 << TIMRG_IM_ICOV_Pos);
		if(captureH_int_en | captureL_int_en | captureOV_int_en | ((TIMRG->IM0 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR0_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR0_IRQn);
		}
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->ICCR &= ~(TIMRG_ICCR_EN1_Msk | TIMRG_ICCR_POL1_Msk);
		TIMRG->ICCR |= (1 << TIMRG_ICCR_EN1_Pos) |
					   (start_lvl << TIMRG_ICCR_POL1_Pos);
		TIMRG->IE1 |= (1 << TIMRG_IE_ICH_Pos) |
					  (1 << TIMRG_IE_ICL_Pos) |
					  (1 << TIMRG_IE_ICOV_Pos);
		TIMR_IC_CaptureH_INTClr(TIMR1);
		if(captureH_int_en)  TIMRG->IM1 &= ~(1 << TIMRG_IM_ICH_Pos);
		else                 TIMRG->IM1 |=  (1 << TIMRG_IM_ICH_Pos);
		TIMR_IC_CaptureL_INTClr(TIMR1);
		if(captureL_int_en)  TIMRG->IM1 &= ~(1 << TIMRG_IM_ICL_Pos);
		else                 TIMRG->IM1 |=  (1 << TIMRG_IM_ICL_Pos);
		TIMR_IC_CaptureOV_INTClr(TIMR1);
		if(captureOV_int_en) TIMRG->IM1 &= ~(1 << TIMRG_IM_ICOV_Pos);
		else                 TIMRG->IM1 |=  (1 << TIMRG_IM_ICOV_Pos);
		if(captureH_int_en | captureL_int_en | captureOV_int_en | ((TIMRG->IM1 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR1_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR1_IRQn);
		}
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->ICCR &= ~(TIMRG_ICCR_EN2_Msk | TIMRG_ICCR_POL2_Msk);
		TIMRG->ICCR |= (1 << TIMRG_ICCR_EN2_Pos) |
					   (start_lvl << TIMRG_ICCR_POL2_Pos);
		TIMRG->IE2 |= (1 << TIMRG_IE_ICH_Pos) |
					  (1 << TIMRG_IE_ICL_Pos) |
					  (1 << TIMRG_IE_ICOV_Pos);
		TIMR_IC_CaptureH_INTClr(TIMR2);
		if(captureH_int_en)  TIMRG->IM2 &= ~(1 << TIMRG_IM_ICH_Pos);
		else                 TIMRG->IM2 |=  (1 << TIMRG_IM_ICH_Pos);
		TIMR_IC_CaptureL_INTClr(TIMR2);
		if(captureL_int_en)  TIMRG->IM2 &= ~(1 << TIMRG_IM_ICL_Pos);
		else                 TIMRG->IM2 |=  (1 << TIMRG_IM_ICL_Pos);
		TIMR_IC_CaptureOV_INTClr(TIMR2);
		if(captureOV_int_en) TIMRG->IM2 &= ~(1 << TIMRG_IM_ICOV_Pos);
		else                 TIMRG->IM2 |=  (1 << TIMRG_IM_ICOV_Pos);
		if(captureH_int_en | captureL_int_en | captureOV_int_en | ((TIMRG->IM2 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR2_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR2_IRQn);
		}
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->ICCR &= ~(TIMRG_ICCR_EN3_Msk | TIMRG_ICCR_POL3_Msk);
		TIMRG->ICCR |= (1 << TIMRG_ICCR_EN3_Pos) |
					   (start_lvl << TIMRG_ICCR_POL3_Pos);
		TIMRG->IE3 |= (1 << TIMRG_IE_ICH_Pos) |
					  (1 << TIMRG_IE_ICL_Pos) |
					  (1 << TIMRG_IE_ICOV_Pos);
		TIMR_IC_CaptureH_INTClr(TIMR3);
		if(captureH_int_en)  TIMRG->IM3 &= ~(1 << TIMRG_IM_ICH_Pos);
		else                 TIMRG->IM3 |=  (1 << TIMRG_IM_ICH_Pos);
		TIMR_IC_CaptureL_INTClr(TIMR3);
		if(captureL_int_en)  TIMRG->IM3 &= ~(1 << TIMRG_IM_ICL_Pos);
		else                 TIMRG->IM3 |=  (1 << TIMRG_IM_ICL_Pos);
		TIMR_IC_CaptureOV_INTClr(TIMR3);
		if(captureOV_int_en) TIMRG->IM3 &= ~(1 << TIMRG_IM_ICOV_Pos);
		else                 TIMRG->IM3 |=  (1 << TIMRG_IM_ICOV_Pos);
		if(captureH_int_en | captureL_int_en | captureOV_int_en | ((TIMRG->IM3 & TIMRG_IM_IF_Msk) == 0)) 
		{
			NVIC_EnableIRQ(TIMR3_IRQn);
		}
		else
		{
			NVIC_DisableIRQ(TIMR3_IRQn);
		}
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_IC_Start()
* 功能说明:	输入捕获功能启动，只有当系统中只使用一路输入捕获时使用此函数启动，当系统中使用多路输入捕获时须使用TIMR_IC_Start_Multi()启动
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 只有当系统中只使用一路输入捕获时使用此函数启动，当系统中使用多路输入捕获时须使用TIMR_IC_Start_Multi()启动
******************************************************************************************************************************************/
void TIMR_IC_Start(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->ICCR |= (1 << TIMRG_ICCR_GO0_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->ICCR |= (1 << TIMRG_ICCR_GO1_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->ICCR |= (1 << TIMRG_ICCR_GO2_Pos);
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->ICCR |= (1 << TIMRG_ICCR_GO3_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_IC_Start_Multi()
* 功能说明:	输入捕获功能启动，同时启动多路
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
*			uint32_t timr0			是否启动TIMR0输入捕获功能，0 不启动   1 启动
*			uint32_t timr1			是否启动TIMR1输入捕获功能，0 不启动   1 启动
*			uint32_t timr2			是否启动TIMR2输入捕获功能，0 不启动   1 启动
*			uint32_t timr3			是否启动TIMR3输入捕获功能，0 不启动   1 启动
* 输    出: 无
* 注意事项: 系统中使用多路输入捕获时须使用TIMR_IC_Start_Multi()启动
******************************************************************************************************************************************/
void TIMR_IC_Start_Multi(uint32_t timr0, uint32_t timr1, uint32_t timr2, uint32_t timr3)
{
	TIMRG->ICCR |= (timr0 << TIMRG_ICCR_GO0_Pos) | 
				   (timr1 << TIMRG_ICCR_GO1_Pos) | 
				   (timr2 << TIMRG_ICCR_GO2_Pos) | 
				   (timr3 << TIMRG_ICCR_GO3_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_IC_Stop()
* 功能说明:	输入捕获功能停止
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_Stop(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->ICCR &= ~(1 << TIMRG_ICCR_GO0_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->ICCR &= ~(1 << TIMRG_ICCR_GO1_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->ICCR &= ~(1 << TIMRG_ICCR_GO2_Pos);
		break;
	
