Synwit-Co-Ltd/SWM160/SWM160_Lib/SWM160_StdPeriph_Driver/CSL/SWM160_StdPeriph_Driver/SWM160_timr.c
	case ((uint32_t)TIMR3):
		TIMRG->IM3 |= (1 << TIMRG_IM_ICL_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	TIMR_IC_CaptureL_INTClr()
* 功能说明:	清除输入捕获低电平长度测量完成中断标志
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureL_INTClr(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->IF0 = (0x01 << TIMRG_IF_ICL_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->IF1 = (0x01 << TIMRG_IF_ICL_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->IF2 = (0x01 << TIMRG_IF_ICL_Pos);
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->IF3 = (0x01 << TIMRG_IF_ICL_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_IC_CaptureL_INTStat()
* 功能说明:	获取输入捕获低电平长度测量完成中断状态
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: uint32_t 				0 低电平长度测量未完成    1 低电平长度测量完成
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_IC_CaptureL_INTStat(TIMR_TypeDef * TIMRx)
{
	uint32_t stat = 0;
	
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		stat = ((TIMRG->IF0 >> TIMRG_IF_ICL_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR1):
		stat = ((TIMRG->IF1 >> TIMRG_IF_ICL_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR2):
		stat = ((TIMRG->IF2 >> TIMRG_IF_ICL_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR3):
		stat = ((TIMRG->IF3 >> TIMRG_IF_ICL_Pos) & 1);
		break;
	}
	
	return stat;
}

/****************************************************************************************************************************************** 
* 函数名称:	TIMR_IC_CaptureOV_INTEn()
* 功能说明:	使能输入捕获溢出中断
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureOV_INTEn(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->IM0 &= ~(1 << TIMRG_IM_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->IM1 &= ~(1 << TIMRG_IM_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->IM2 &= ~(1 << TIMRG_IM_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->IM3 &= ~(1 << TIMRG_IM_ICOV_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_IC_CaptureOV_INTDis()
* 功能说明:	禁能输入捕获溢出中断
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureOV_INTDis(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->IM0 |= (1 << TIMRG_IM_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->IM1 |= (1 << TIMRG_IM_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->IM2 |= (1 << TIMRG_IM_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->IM3 |= (1 << TIMRG_IM_ICOV_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	TIMR_IC_CaptureOV_INTClr()
* 功能说明:	清除输入捕获溢出中断标志
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureOV_INTClr(TIMR_TypeDef * TIMRx)
{
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		TIMRG->IF0 = (0x01 << TIMRG_IF_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR1):
		TIMRG->IF1 = (0x01 << TIMRG_IF_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR2):
		TIMRG->IF2 = (0x01 << TIMRG_IF_ICOV_Pos);
		break;
	
	case ((uint32_t)TIMR3):
		TIMRG->IF3 = (0x01 << TIMRG_IF_ICOV_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称: TIMR_IC_CaptureOV_INTStat()
* 功能说明:	获取输入捕获溢出中断状态
* 输    入: TIMR_TypeDef * TIMRx	指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3
* 输    出: uint32_t 				0 未发生溢出    1 发生溢出
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_IC_CaptureOV_INTStat(TIMR_TypeDef * TIMRx)
{
	uint32_t stat = 0;
	
	switch((uint32_t)TIMRx)
	{
	case ((uint32_t)TIMR0):
		stat = ((TIMRG->IF0 >> TIMRG_IF_ICOV_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR1):
		stat = ((TIMRG->IF1 >> TIMRG_IF_ICOV_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR2):
		stat = ((TIMRG->IF2 >> TIMRG_IF_ICOV_Pos) & 1);
		break;
	
	case ((uint32_t)TIMR3):
		stat = ((TIMRG->IF3 >> TIMRG_IF_ICOV_Pos) & 1);
		break;
	}
	
	return stat;
}
